import os


# os.getcwd() -> বর্তমানে আমাদের স্ক্রিপ্ট যে ডিরেক্টরিতে আছে, সেটা পাওয়া যায়।

# ******************************

# * এই ফাংশন দিয়ে ডিরেক্টরি চেঞ্জ করা হয়। এটা অনেকটা ইউনিক্স কমান্ড cd-এর সমতুল্য। আমরা কারেন্ট ওয়ার্কিং ডিরেক্টরি পরিবর্তন করে অন্য কোনো ডিরেক্টরিতে যেতে চাইলে এই ফাংশনের মধ্যে সেই ডিরেক্টরির পাথ পাস করব।

# print(os.getcwd())
# os.chdir('/programming/python')
# print(os.getcwd())

# ******************************

#* NEW FOLDER ফোল্ডারে যাই তাহলে দেখব, সেখানে 1 নামে একটি ফোল্ডার আছে, 1-এর মধ্যে 2 নামে একটি ফোল্ডার, 2-এর মধ্যে আছে 3 নামে একটি ফোল্ডার, 3-এর মধ্যে আছে 4 নামে একটি ফোল্ডার এবং 4-এর মধ্যে আছে 5 নামে একটি ফোল্ডার। আসলে আমাদের এখানে দরকার ছিল 5 নামে যে ফোল্ডারটি সেটি তৈরি করা। কিন্তু 5 নামের ফোল্ডারটা আরও কয়েকটা ফোল্ডারের মধ্যে থাকবে, যা ইতিমধ্যে তৈরি করা নেই। সেগুলো আমরা একটা একটা করে তৈরি না করে এই পদ্ধতিতে এক ধাক্কায় কিন্তু পগার পার করে ফেললাম।

#print(os.mkdir("NEW_FOLDER"))  # * Create NEW FOLDER
# print(os.getcwd())
# print(os.makedirs('./NEW_FOLDER/1/2/3/4/5/6'))


# ******************************
# *এই ফাংশনটি লিনাক্সের rm কমান্ডের সমতুল্য। যখন কোনো একটা ফাইল ডিলিট করার দরকার পড়বে, তখন আমরা এই ফাংশন ব্যবহার করব।

os.getcwd()
os.remove("h.txt")