""" 
এই প্রগ্রাম দিয়ে গোল্ড এর 
* আনা টু ভড়ি + প্রাইস
* আনা টু গ্রাম + প্রাইস
* গ্রাম টু কেজি + প্রাইস

    -> STEP
    * -> ৩ টা ফাংশন নিতে হবে কেল্কুলেশ্ন এর জন্য
    * -> মেচ কেস ব্যবহার করতে হবে 
"""


def AnaToGM(n):
    """ 
    We know, 1 Aana = 0.7287567409998542 gm
    Therefore, 1.3722 Aana = *0.7287567409998542 gm
    """
    ana = 0.7287567409998542
    return ana * 1.3722

def GmToVori(n):
    """ 
    We know, 1 vori = 11.66 gm
    Therefore, 1 vori = 1*11.66 gm
    """
    vori = 0.7287567409998542
    return ana * 1.3722
